; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 - counter
	)
  (:init
		(= (value c0) 27)
	(= (value c1) 24)
	(= (value c2) 9)
	(= (value c3) 41)
	(= (value c4) 15)
	(= (value c5) 83)
	(= (value c6) 44)
	(= (value c7) 45)
	(= (value c8) 52)
	(= (value c9) 93)
	(= (value c10) 98)
	(= (value c11) 17)
	(= (value c12) 56)
	(= (value c13) 70)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
		)
	)
)

; plan
1. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 8 of 13
2. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 8 of 13
3. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 8 of 13
4. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 8 of 13
5. (increment c1)
   changed: (value c1) from 24 to 26
   goals met: 8 of 13
6. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 8 of 13
7. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 8 of 13
8. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 8 of 13
9. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 8 of 13
10. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 8 of 13
11. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 8 of 13
12. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 8 of 13
13. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 8 of 13
14. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 8 of 13
15. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 8 of 13
16. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 8 of 13
17. (increase_rate c11)
   changed: (rate_value c11) from 6 to 7
   goals met: 8 of 13
18. (increase_rate c11)
   changed: (rate_value c11) from 7 to 8
   goals met: 8 of 13
19. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 8 of 13
20. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 8 of 13
21. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 8 of 13
22. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 8 of 13
23. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 8 of 13
24. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 8 of 13
25. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 8 of 13
26. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 8 of 13
27. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 8 of 13
28. (increment c1)
   changed: (value c1) from 26 to 28
   goals met: 9 of 13
29. (increase_rate c11)
   changed: (rate_value c11) from 8 to 9
   goals met: 9 of 13
30. (increment c11)
   changed: (value c11) from 17 to 26
   goals met: 9 of 13
31. (increment c11)
   changed: (value c11) from 26 to 35
   goals met: 9 of 13
32. (increment c11)
   changed: (value c11) from 35 to 44
   goals met: 9 of 13
33. (increment c11)
   changed: (value c11) from 44 to 53
   goals met: 9 of 13
34. (increase_rate c11)
   changed: (rate_value c11) from 9 to 10
   goals met: 9 of 13
35. (increment c11)
   changed: (value c11) from 53 to 63
   goals met: 8 of 13
36. (decrement c10)
   changed: (value c10) from 98 to 93
   goals met: 7 of 13
37. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 7 of 13
38. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 7 of 13
39. (increment c6)
   changed: (value c6) from 44 to 51
   goals met: 6 of 13
40. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 6 of 13
41. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 6 of 13
42. (increment c6)
   changed: (value c6) from 51 to 60
   goals met: 6 of 13
43. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 6 of 13
44. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 13
45. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 13
46. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 6 of 13
47. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 6 of 13
48. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 6 of 13
49. (increment c4)
   changed: (value c4) from 15 to 20
   goals met: 6 of 13
50. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 6 of 13
51. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 6 of 13
52. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 6 of 13
53. (increment c4)
   changed: (value c4) from 20 to 26
   goals met: 6 of 13
54. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 6 of 13
55. (increment c4)
   changed: (value c4) from 26 to 33
   goals met: 6 of 13
56. (increment c4)
   changed: (value c4) from 33 to 40
   goals met: 6 of 13
57. (increment c4)
   changed: (value c4) from 40 to 47
   goals met: 7 of 13
58. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 7 of 13
59. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 7 of 13
60. (increment c2)
   changed: (value c2) from 9 to 14
   goals met: 7 of 13
61. (increment c2)
   changed: (value c2) from 14 to 19
   goals met: 7 of 13
62. (increment c2)
   changed: (value c2) from 19 to 24
   goals met: 7 of 13
63. (increment c2)
   changed: (value c2) from 24 to 29
   goals met: 8 of 13
64. (decrement c10)
   changed: (value c10) from 93 to 88
   goals met: 8 of 13
65. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 8 of 13
66. (increment c10)
   changed: (value c10) from 88 to 94
   goals met: 9 of 13
67. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 9 of 13
68. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 9 of 13
69. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 9 of 13
70. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 9 of 13
71. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 9 of 13
72. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 9 of 13
73. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 9 of 13
74. (increment c7)
   changed: (value c7) from 45 to 48
   goals met: 9 of 13
75. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 9 of 13
76. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 9 of 13
77. (decrement c5)
   changed: (value c5) from 83 to 78
   goals met: 9 of 13
78. (decrement c5)
   changed: (value c5) from 78 to 73
   goals met: 9 of 13
79. (decrement c5)
   changed: (value c5) from 73 to 68
   goals met: 9 of 13
80. (decrement c5)
   changed: (value c5) from 68 to 63
   goals met: 9 of 13
81. (decrement c5)
   changed: (value c5) from 63 to 58
   goals met: 10 of 13
82. (increment c7)
   changed: (value c7) from 48 to 51
   goals met: 10 of 13
83. (decrement c6)
   changed: (value c6) from 60 to 50
   goals met: 10 of 13
84. (decrement c5)
   changed: (value c5) from 58 to 53
   goals met: 10 of 13
85. (decrement c5)
   changed: (value c5) from 53 to 48
   goals met: 11 of 13
86. (increment c11)
   changed: (value c11) from 63 to 73
   goals met: 11 of 13
87. (increment c11)
   changed: (value c11) from 73 to 83
   goals met: 11 of 13
88. (decrement c10)
   changed: (value c10) from 94 to 84
   goals met: 10 of 13
89. (decrement_rate c11)
   changed: (rate_value c11) from 10 to 9
   goals met: 10 of 13
90. (decrement c11)
   changed: (value c11) from 83 to 74
   goals met: 10 of 13
91. (decrement c11)
   changed: (value c11) from 74 to 65
   goals met: 10 of 13
92. (increase_rate c11)
   changed: (rate_value c11) from 9 to 10
   goals met: 10 of 13
93. (increment c11)
   changed: (value c11) from 65 to 75
   goals met: 10 of 13
94. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 10 of 13
95. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 10 of 13
96. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 10 of 13
97. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 10 of 13
98. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 10 of 13
99. (increment c12)
   changed: (value c12) from 56 to 61
   goals met: 10 of 13
100. (increment c12)
   changed: (value c12) from 61 to 66
   goals met: 10 of 13
101. (decrement c11)
   changed: (value c11) from 75 to 65
   goals met: 11 of 13
102. (decrement c10)
   changed: (value c10) from 84 to 74
   goals met: 11 of 13
103. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 11 of 13
104. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 11 of 13
105. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 11 of 13
106. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 11 of 13
107. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 11 of 13
108. (increment c10)
   changed: (value c10) from 74 to 84
   goals met: 11 of 13
109. (decrement c9)
   changed: (value c9) from 93 to 88
   goals met: 11 of 13
110. (decrement c9)
   changed: (value c9) from 88 to 83
   goals met: 12 of 13
111. (decrement c10)
   changed: (value c10) from 84 to 74
   goals met: 11 of 13
112. (decrement c10)
   changed: (value c10) from 74 to 64
   goals met: 12 of 13
113. (decrement c9)
   changed: (value c9) from 83 to 78
   goals met: 12 of 13
114. (decrement c9)
   changed: (value c9) from 78 to 73
   goals met: 12 of 13
115. (decrement c9)
   changed: (value c9) from 73 to 68
   goals met: 12 of 13
116. (decrement c9)
   changed: (value c9) from 68 to 63
   goals met: 13 of 13
